/**===File Commentary=======================================*/
/**
 *	@file	GameMain.cpp
 *
 *	@brief	ゲームメインクラス実装
 *
 *	@author	KORYUOH
 *
 *	@date	2012/05/01
 */
/**===File Include=========================================*/
#include	<GameLogic/impl/GameMain.h>
/**===Class Implementation=================================*/

/**========================================================*/
/**
 *	@brief	<要約>
 *	@param[in]	<引数>
 *	@attention	<注意書き>
 *	@note	<メモ書き>
 *	@author	<作者名>
 *	@return	<戻り値>
 */
/**========================================================*/
void GameMain::initialize(void){
}
/**========================================================*/
/**
 *	@brief	<要約>
 *	@param[in]	<引数>
 *	@attention	<注意書き>
 *	@note	<メモ書き>
 *	@author	<作者名>
 *	@return	<戻り値>
 */
/**========================================================*/
void GameMain::update(float f){
}
/**========================================================*/
/**
 *	@brief	<要約>
 *	@param[in]	<引数>
 *	@attention	<注意書き>
 *	@note	<メモ書き>
 *	@author	<作者名>
 *	@return	<戻り値>
 */
/**========================================================*/
void GameMain::draw(){
	
}
/**========================================================*/
/**
 *	@brief	<要約>
 *	@param[in]	<引数>
 *	@attention	<注意書き>
 *	@note	<メモ書き>
 *	@author	<作者名>
 *	@return	<戻り値>
 */
/**========================================================*/
void GameMain::finish(){
}
/**===End Of File==========================================*/