/**===File Commentary=======================================*/
/**
 *	@file	Effect.cpp
 *
 *	@brief	エフェクトクラス実装
 *
 *	@note	OpenGL
 *
 *	@author	KORYUOH
 *
 *	@date	2012/02/23
 */
/**===File Include=========================================*/
#include	<Render/OpenGL/Effect.h>
/**===Class Implementation=================================*/

/**========================================================*/
/**
 *	@brief	<要約>
 *	@param[in]	<引数>
 *	@attention	<注意書き>
 *	@note	<メモ書き>
 *	@author	KORYUOH
 *	@return	<戻り値>
 */
/**========================================================*/


/**===End Of File==========================================*/