/******************************************************************************
* File Name : InputID.h                             Ver : 1.00  Date : 2012-12-14
*
* Description :
*
*		入力抽象クラス．
*
* Author : Shouta Takemura.
*
******************************************************************************/
#ifndef _INPUT_ID_H_
#define _INPUT_ID_H_


/*---- ヘッダファイルの読み込み ---------------------------------------------*/

/*---- 先行宣言 -------------------------------------------------------------*/


//入力ID
enum InputID
{

	/*---- 矢印キー ---------------------------------------------------------*/

	//上キー
	UP_KEY_ARROW,
	//下キー
	DOWON_KEY_ARROW,
	//右キー
	RIGHT_KEY_ARROW,
	//左キー
	LEFT_KEY_ARROW,

	/*---- 特定のキー -------------------------------------------------------*/

	//スタートキー
	START_KEY,
	//ショットキー
	SHOOT_KEY,
	//エンターキー
	ENTER_KEY,
};

#endif

/********** End of File ******************************************************/
