/**===File Commentary=======================================*/
/**
 *	@file	Vector3.cpp
 *
 *	@brief	三次元ベクトル
 *
 *	@author	KORYUOH
 *
 *	@date	2012/06/26
 */
/**===File Include=========================================*/
#include	<Type/Vector3/Vector3.h>
#include	<cmath>
/**===Class Implementation=================================*/

/**========================================================*/
/**
 *	@brief	コンストラクタ
 */
/**========================================================*/
Vector3::Vector3()
	:x_(0),y_(0),z_(0)
{}
/**========================================================*/
/**
 *	@brief	コンストラクタ
 *	@param[in]	X座標
 *	@param[in]	Y座標
 *	@param[in]	Z座標
 */
/**========================================================*/
Vector3::Vector3(float x , float y , float z)
	:x_(x)
	,y_(y)
	,z_(z)
{}
/**========================================================*/
/**
 *	@brief	ノルムを取得
 *	@return	ノルム
 */
/**========================================================*/
float Vector3::length()const{
	return (float)std::sqrtf((x_*x_)+(y_*y_)+(z_*z_));
}
/**========================================================*/
/**
 *	@brief	正規化を行う
 *	@return	正規化されたベクトル
 */
/**========================================================*/
Vector3& Vector3::normalize(){
	float len = length();
	if( len != 0){
		*this /= len;
		return *this;
	}
	return *this;
}
/**========================================================*/
/**
 *	@brief	内積
 *	@param[in]	他のベクトル
 *	@return	内積値
 */
/**========================================================*/
float Vector3::InnerProduct(const Vector3& v)const{
	return (x_*v.x_)+(y_*v.y_)+(z_*v.z_);
}
/**========================================================*/
/**
 *	@brief	外積
 *	@param[in]	他のベクトル
 *	@return	外積値
 */
/**========================================================*/
Vector3 Vector3::OuterProduct(const Vector3& v) const{
	return Vector3 (
		(y_*v.z_) - (z_ * v.y_),
		(z_*v.x_) - (x_ * v.z_),
		(x_*v.y_) - (y_ * v.x_) 
		);
}
/**========================================================*/
/**
 *	@brief	単項演算子オーバーロード
 *	@return	ベクトル
 */
/**========================================================*/
Vector3 Vector3::operator + () const {
	return *this;
}
/**========================================================*/
/**
 *	@brief	単項演算子オーバーロード
 *	@return	逆ベクトル
 */
/**========================================================*/
Vector3 Vector3::operator-()const{
	return Vector3 (-x_,-y_,-z_);
}
/**========================================================*/
/**
 *	@brief	代入演算子オーバーロード
 *	@param[in]	加算値ベクトル
 *	@return	三次元ベクトル
 */
/**========================================================*/
Vector3& Vector3::operator += (const Vector3& v){
	x_ += v.x_;
	y_ += v.y_;
	z_ += v.z_;
	return *this;
	}
/**========================================================*/
/**
 *	@brief	代入演算子オーバーロード
 *	@param[in]		減算値ベクトル
 *	@return	三次元ベクトル
 */
/**========================================================*/
Vector3& Vector3::operator -= (const Vector3& v){
	x_ -= v.x_;
	y_ -= v.y_;
	z_ -= v.z_;
	return *this;
}
/**========================================================*/
/**
 *	@brief	代入演算子オーバーロード
 *	@param[in]	乗算値
 *	@return	三次元ベクトル
 */
/**========================================================*/
Vector3& Vector3::operator *= (float s){
	x_ *= s;
	y_ *= s;
	z_ *= s;
	return *this;
	}
/**========================================================*/
/**
 *	@brief	代入演算子オーバーロード
 *	@param[in]	除算値
 *	@return	三次元ベクトル
 */
/**========================================================*/
Vector3& Vector3::operator /= (float s){
	x_ /= s;
	y_ /= s;
	z_ /= s;
	return *this;
	}
/**========================================================*/
/**
 *	@brief	2項演算子オーバーロード
 *	@param[in]	ベクトル1
 *	@param[in]	ベクトル2
 *	@return	加算ベクトル
 */
/**========================================================*/
const Vector3 operator + ( const Vector3& v1 , const Vector3& v2){
	Vector3 result( v1) ;
	result += v2;
	return result;
}
/**========================================================*/
/**
 *	@brief	2項演算子オーバーロード
 *	@param[in]	ベクトル1
 *	@param[in]	ベクトル2
 *	@return	加算ベクトル
 */
/**========================================================*/
const Vector3 operator - ( const Vector3& v1 , const Vector3& v2){
	Vector3 retult( v1) ;
	retult -= v2;
	return retult;

}
/**========================================================*/
/**
 *	@brief	2項演算子オーバーロード
 *	@param[in]	ベクトル
 *	@param[in]	スカラ
 *	@return	ベクトル
 */
/**========================================================*/

const Vector3 operator * ( const Vector3& v , float s){
	Vector3 retult( v) ;
	retult *= s;
	return retult;

}
/**========================================================*/
/**
 *	@brief	2項演算子オーバーロード
 *	@param[in]	スカラ
 *	@param[in]	ベクトル
*	@return	ベクトル
 */
/**========================================================*/
const Vector3 operator * ( float s , const Vector3& v){
	return v*s;

}
/**========================================================*/
/**
 *	@brief	2項演算子オーバーロード
 *	@param[in]	ベクトル
 *	@param[in]	スカラ
 *	@return	ベクトル
 */
/**========================================================*/
const Vector3 operator / ( const Vector3& v , float s){
	Vector3 retult( v) ;
	retult /= s;
	return retult;

}
/**===End Of File==========================================*/