/******************************************************************************
* File Name : Screen.h                            Ver : 1.00  Date : 2012-12-14
*
* Description :
*
*		スクリーン構造体．
*
******************************************************************************/
#include"Screen.h"

/// <summary>
/// スクリーン横幅.
/// </summary>
const int Screen::WIDTH	= 1024;
/// <summary>
/// スクリーン縦幅.
/// </summary>
const int Screen::HEIGHT= 768;

/********** End of File ******************************************************/
