/**===File Commentary=======================================*/
/**
 *	@file	AppParam.cpp
 *
 *	@brief	アプリケーションデータ
 *
 *	@author	KORYUOH
 *
 *	@date	2013/04/28
 */
/**===File Include=========================================*/
#include	<Application/AppParam/AppParam.h>
/**===Class Implementation=================================*/

/**========================================================*/
/**
 *	@brief	コンストラクタ
 */
/**========================================================*/
AppParam::AppParam()
	:mWindowParam(0.0f,0.0f,640.0f,480.0f)
	,mWindowTitle("GameWindow")
	,mFullScreen(false)
{
}
/**========================================================*/
/**
 *	@brief	仮想デストラクタ
 */
/**========================================================*/
AppParam::~AppParam(){
}
/**========================================================*/
/**
 *	@brief	ウィンドウパラメータ取得
 *	@return	ウィンドウパラメータ
 */
/**========================================================*/
const Rect& AppParam::getWindowParam()const{
	return mWindowParam;
}
/**========================================================*/
/**
 *	@brief	ウィンドウタイトル取得
 *	@return	ウィンドウタイトル
 */
/**========================================================*/
const std::string& AppParam::getWindowTitle()const{
	return mWindowTitle;
}
/**========================================================*/
/**
 *	@brief	フルスクリーンか？
 *	@return	フルスクリーンで真
 */
/**========================================================*/
bool AppParam::isFullscreenMode()const{
	return mFullScreen;
}
/**========================================================*/
/**
 *	@brief	フルスクリーンモード有効
 */
/**========================================================*/
void AppParam::FullscreenModeActivate(){
	mFullScreen = true;
}
/**========================================================*/
/**
 *	@brief	ウィンドウパラメータ設定
 *	@param[in]	パラメータ
 */
/**========================================================*/
void AppParam::setWindowParam(const Rect& param){
	mWindowParam = param;
}
/**========================================================*/
/**
 *	@brief	ウィンドウタイトル設定
 *	@param[in]	ウィンドウタイトル
 */
/**========================================================*/
void AppParam::setWindowTitle(const std::string& title){
	mWindowTitle = title;
}

/**===End Of File==========================================*/