/******************************************************************************
* File Name : UnitPtr.h                          Ver : 1.00  Date : 2013-04-25
*
* Description :
*
*		ユニットシェアドポインタ．
*
******************************************************************************/
#ifndef _UNIT_PTR_H_
#define _UNIT_PTR_H_

/*---- ヘッダファイルの読み込み ---------------------------------------------*/

#include<memory>

/*---- 先行宣言 -------------------------------------------------------------*/

class Unit;

/// <summary>
/// ユニットシェアドポインタ.
/// </summary>
typedef std::shared_ptr<Unit> UnitPtr;

#endif

/********** End of File ******************************************************/
